[
    {
        "partner": "Carsten Ahrens, CEO, G+D Mobile Security",
        "quote": "It is a privilege for G+D Mobile Security to be part of this landmark project, and we are fully committed to make OpenTitan the first Open Source RoT hardware platform that will be certified to meet the requirements of all cloud and IoT security use cases."
    },
    {
        "partner": "Andy Hopper, Chairman of the Board of Directors, lowRISC",
        "quote": "The silicon root of trust is too important a foundational security technology to be proprietary; the OpenTitan project is another example of how open source development encourages innovation and serves greater interests by creating a truly trustworthy piece of silicon. As someone involved in the computer science and hardware industry for several decades, I'm encouraged to see companies working in a more collaborative and transparent fashion with researchers and the open source community to continue innovating in a post-Moore's law world."
    },
    {
        "partner": "Professor Luca Benini, ETH Zürich",
        "quote": "OpenTitan is a major milestone on the road to secure and open silicon. My research teams in ETH Zurich and University of Bologna have been working for years on Open Hardware and were very excited to be one of the first contributors to the OpenTitan Project. Our entire team now looks forward to participating in its future development and broad deployment across the silicon industry."
    },
    {
        "partner": "Erez Naory, VP of Marketing Security Products, Nuvoton",
        "quote": "Nuvoton is striving to provide its customers with best-in-class security IC solutions including Root-of-Trust ICs for server and client spaces. We believe that an open source hardware approach can bring value to all our customers similarly to what happened in the software space.  A logically open source hardware solution will enable Nuvoton to come-up with a more trusted, transparent and secure solution."
    },
    {
        "partner": "Dr. Richard New, Vice President of R&D, Western Digital",
        "quote": "As the volume and value of data continues to grow exponentially, so does the need to keep that data safe and secure. OpenTitan leverages the power and transparency of the open-source development model to enable root of trust chips that can be fully inspected and verified, thereby providing strong security against malware, physical hardware modifications and other threats. Our work with the OpenTitan project, and ongoing collaboration with the open-source community and security ecosystem, furthers our commitment to accelerating the development of more secure data infrastructure as we move into the Zettabyte Age."
    },
    {
        "partner": "Alex Bradbury, CTO, lowRISC",
        "quote": "We believe collaboratively developed open source silicon designs provide the flexible, cost effective base needed for future generations of secure hardware products. The lowRISC not-for-profit structure combined with full stack engineering capabilities in-house, enables us to manage high quality projects like OpenTitan, and we look forward to developing this partnership and new ones in the future."
    },
    {
        "partner": "Dominic Rizzo, OpenTitan Project Director, lowRISC",
        "quote": "Customers are asked to put faith in proprietary root of trust chips for mission-critical systems without the ability to fully understand, inspect and therefore trust them. By creating OpenTitan with the broader hardware and academic community, we leverage the experience and security principles used to create Google's Titan chips to make hardware root of trust designs more transparent, inspectable, and accessible to the rest of the industry. Security should never be built on opacity."
    }
]
