# Copyright lowRISC contributors.
# Licensed under the Apache License, Version 2.0, see LICENSE for details.
# SPDX-License-Identifier: Apache-2.0

# yosys synthesis script

read -sv prim_clock_gating.v syn_out/*.v
synth -top ibex_core
write_verilog ibex_core_premap.v

# mapping to cmos_cells.lib
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
write_verilog ibex_core_netlist.v

# reports
check
stat
